# Predefined LFE functions

The following more or less standard lisp functions are predefined:

## Operators

```lisp
(<arith_op> expr ...)
```
The standard arithmentic operators, ``+`` ``-`` ``*`` and ``/`` can
take multiple arguments the same as their standard Lisp counterparts. 
This is still experimental and implemented using macros. They do,
however, behave like normal functions and evaluate ALL their
arguments before doing the arithmetic operations.

Examples:

```lisp
> (- 43 1)
42
> (* 21 2)
42
```


```lisp
(<comp_op> expr ...)
```
The standard comparison operators, ``>``, ``>=``, ``<``, ``=<``, ``==``,
``/=``, ``=:=``, and ``=/=`` can take multiple arguments the same as 
their standard Lisp counterparts. This is still experimental and 
implemented using macros. They do, however, behave like normal functions 
and evaluate ALL their arguments before doing the comparison
operations.

Examples:

```lisp
> (> 1 42)
false
> (< 42 43)
true
```

## Association list functions

These are the same as found in Common Lisp.

```lisp
(acons key value list)
```

```lisp
(pairlis keys values {{list}})
```

```lisp
(assoc key list)
```

```lisp
(assoc-if test list)
```

```lisp
(assoc-if-not test list)
```

```lisp
(rassoc value list)
```

```lisp
(rassoc-if test list)
```

```lisp
(rassoc-if-not test list)
```

## Substitution of expressions

```lisp
(subst new old tree)
```

```lisp
(subst-if new test tree)
```

```lisp
(subst-if-not new test tree)
```

```lisp
(sublis alist tree)
```

## Expansion macros

```lisp
(macroexpand-1 expr {{environment}})
```

If Expr is a macro call, does one round of expansion,
otherwise returns Expr.

```lisp
(macroexpand expr {{environment}})
```

Returns the expansion returned by calling macroexpand-1
repeatedly, starting with Expr, until the result is no longer
a macro call.
        
```lisp
(macroexpand-all expr {{environment}})
```

Returns the expansion from the expression where all macro
calls have been expanded with macroexpand.

**NOTE**: When no explicit environment is given ti the
macroexpand functions, then only the default built-in macros
will be expanded. Inside macros and in the shell, the variable
``$ENV`` is bound to the current macro environment.

## Evaluation

```lisp
(eval expr {{environment}})
```

Evaluate the expression ``expr``. Note that only the pre-defined
Lisp functions, erlang BIFs and exported functions can be
called. Also no local variables can be accessed. To access
local variables, the ``expr`` to be evaluated can be wrapped in a
``let`` defining these.

For example, if the data we wish to evaluate is in the variable
``expr`` and it assumes there is a local variable ``foo`` which it
needs to access, then we could evaluate it by calling:

```lisp
(eval `(let ((foo ,foo)) ,expr))
```